NXP/GenAVB_TSN-rtos-apps/devices/MIMXRT118x/common/cm33/armgcc/startup_MIMXRT118x_cm33.S
/* ------------------------------------------------------------------------- */
/*  @file:    startup_MIMXRT1189_cm33.s                                      */
/*  @purpose: CMSIS Cortex-M33 Core Device Startup File                      */
/*            MIMXRT1189_cm33                                                */
/*  @version: 0.1                                                            */
/*  @date:    2021-3-9                                                       */
/*  @build:   b220309                                                        */
/* ------------------------------------------------------------------------- */
/*                                                                           */
/* Copyright 1997-2016 Freescale Semiconductor, Inc.                         */
/* Copyright 2016-2024 NXP                                                   */
/* All rights reserved.                                                      */
/*                                                                           */
/* SPDX-License-Identifier: BSD-3-Clause                                     */
/*****************************************************************************/
/* Version: GCC for ARM Embedded Processors                                  */
/*****************************************************************************/
    .syntax unified
    .arch armv8-m.main

    .section .isr_vector, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   __StackTop                                      /* Top of Stack */
    .long   Reset_Handler                                   /* Reset Handler */
    .long   NMI_Handler                                     /* NMI Handler*/
    .long   Fault_Handler                                   /* Hard Fault Handler*/
    .long   Fault_Handler                                   /* MPU Fault Handler*/
    .long   Fault_Handler                                   /* Bus Fault Handler*/
    .long   Fault_Handler                                   /* Usage Fault Handler*/
    .long   Fault_Handler                                   /* Secure Fault Handler*/
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   SVC_Handler                                     /* SVCall Handler*/
    .long   DebugMon_Handler                                /* Debug Monitor Handler*/
    .long   0                                               /* Reserved*/
    .long   PendSV_Handler                                  /* PendSV Handler*/
    .long   SysTick_Handler                                 /* SysTick Handler*/

                                                            /* External Interrupts*/
    .long   TMR1_IRQHandler                                 /* TMR1 interrupt*/
    .long   DAP_IRQHandler                                  /* DAP interrupt*/
    .long   M7_CTI_TRIGGER_OUTPUT_IRQHandler                /* CTI trigger outputs from CM7*/
    .long   M33_CTI_TRIGGER_OUTPUT_IRQHandler               /* CTI trigger outputs from CM33*/
    .long   TMR5_IRQHandler                                 /* TMR5 interrupt*/
    .long   TMR6_IRQHandler                                 /* TMR6 interrupt*/
    .long   TMR7_IRQHandler                                 /* TMR7 interrupt*/
    .long   TMR8_IRQHandler                                 /* TMR8 interrupt*/
    .long   CAN1_IRQHandler                                 /* CAN1 interrupt*/
    .long   CAN1_ERROR_IRQHandler                           /* CAN1 error interrupt*/
    .long   GPIO1_0_IRQHandler                              /* GPIO1 interrupt 0*/
    .long   GPIO1_1_IRQHandler                              /* GPIO1 interrupt 1*/
    .long   I3C1_IRQHandler                                 /* I3C1 interrupt*/
    .long   LPI2C1_IRQHandler                               /* LPI2C1 interrupt*/
    .long   LPI2C2_IRQHandler                               /* LPI2C2 interrupt*/
    .long   LPIT1_IRQHandler                                /* LPIT1 interrupt*/
    .long   LPSPI1_IRQHandler                               /* LPSPI1 interrupt*/
    .long   LPSPI2_IRQHandler                               /* LPSPI2 interrupt*/
    .long   LPTMR1_IRQHandler                               /* LPTMR1 interrupt*/
    .long   LPUART1_IRQHandler                              /* LPUART1 interrupt*/
    .long   LPUART2_IRQHandler                              /* LPUART2 interrupt*/
    .long   MU1_IRQHandler                                  /* MU1 interrupt*/
    .long   MU2_IRQHandler                                  /* MU2 interrupt*/
    .long   PWM1_FAULT_IRQHandler                           /* PWM1 fault or reload error interrupt*/
    .long   PWM1_0_IRQHandler                               /* PWM1 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM1_1_IRQHandler                               /* PWM1 capture 1, compare 1, or reload 1 interrupt*/
    .long   PWM1_2_IRQHandler                               /* PWM1 capture 2, compare 2, or reload 2 interrupt*/
    .long   PWM1_3_IRQHandler                               /* PWM1 capture 3, compare 3, or reload 3 interrupt*/
    .long   SENTINEL_TRUST_MUA_RX_FULL_IRQHandler           /* Sentinel Trust MUA RX full interrupt*/
    .long   SENTINEL_TRUST_MUA_TX_EMPTY_IRQHandler          /* Sentinel Trust MUA TX empty interrupt*/
    .long   SENTINEL_APPS_CORE_MUA_RX_FULL_IRQHandler       /* Sentinel Apps Core MUA RX full interrupt*/
    .long   SENTINEL_APPS_CORE_MUA_TX_EMPTY_IRQHandler      /* Sentinel Apps Core MUA TX empty interrupt*/
    .long   SENTINEL_REALTIME_CORE_MUA_RX_FULL_IRQHandler   /* Sentinel Realtime Core MUA RX full interrupt*/
    .long   SENTINEL_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler  /* Sentinel Realtime Core MUA TX empty interrupt*/
    .long   SENTINEL_SECURE_IRQHandler                      /* Sentinel secure interrupt*/
    .long   SENTINEL_NONSECURE_IRQHandler                   /* Sentinel non-secure interrupt*/
    .long   TPM1_IRQHandler                                 /* TPM1 interrupt*/
    .long   TPM2_IRQHandler                                 /* TPM2 interrupt*/
    .long   RTWDOG1_IRQHandler                              /* RTWDOG1 interrupt*/
    .long   RTWDOG2_IRQHandler                              /* RTWDOG2 interrupt*/
    .long   Reserved56_IRQHandler                           /* Reserved interrupt*/
    .long   PDM_HWVAD_EVENT_IRQHandler                      /* HWVAD event interrupt*/
    .long   PDM_HWVAD_ERROR_IRQHandler                      /* HWVAD error interrupt*/
    .long   PDM_EVENT_IRQHandler                            /* PDM event interrupt*/
    .long   PDM_ERROR_IRQHandler                            /* PDM error interrupt*/
    .long   SAI1_IRQHandler                                 /* SAI interrupt*/
    .long   M33_PS_IRQHandler                               /* M33 PS Tag/Data Parity Error*/
    .long   M33_TCM_ECC_IRQHandler                          /* M33 TCM ECC interrupt*/
    .long   M33_TCM_ERROR_IRQHandler                        /* M33 TCM Error interrupt*/
    .long   M7_TCM_ECC_IRQHandler                           /* M7 TCM ECC interrupt*/
    .long   M7_TCM_ERROR_IRQHandler                         /* M7 TCM Error interrupt*/
    .long   CAN2_IRQHandler                                 /* CAN2 interrupt*/
    .long   CAN2_ERROR_IRQHandler                           /* CAN2 error interrupt*/
    .long   FLEXIO1_IRQHandler                              /* FLEXIO1 interrupt*/
    .long   FLEXIO2_IRQHandler                              /* FLEXIO2 interrupt*/
    .long   FLEXSPI1_IRQHandler                             /* FLEXSPI1 interrupt*/
    .long   FLEXSPI2_IRQHandler                             /* FLEXSPI2 interrupt*/
    .long   GPIO2_0_IRQHandler                              /* GPIO2 interrupt 0*/
    .long   GPIO2_1_IRQHandler                              /* GPIO2 interrupt 1*/
    .long   GPIO3_0_IRQHandler                              /* GPIO3 interrupt 0*/
    .long   GPIO3_1_IRQHandler                              /* GPIO3 interrupt 1*/
    .long   I3C2_IRQHandler                                 /* I3C2 interrupt*/
    .long   LPI2C3_IRQHandler                               /* LPI2C3 interrupt*/
    .long   LPI2C4_IRQHandler                               /* LPI2C4 interrput*/
    .long   LPIT2_IRQHandler                                /* LPIT2 interrupt*/
    .long   LPSPI3_IRQHandler                               /* LPSPI3 interrupt*/
    .long   LPSPI4_IRQHandler                               /* LPSPI4 interrupt*/
    .long   LPTMR2_IRQHandler                               /* LPTMR2 interrupt*/
    .long   LPUART3_IRQHandler                              /* LPUART3 interrupt*/
    .long   LPUART4_IRQHandler                              /* LPUART4 interrupt*/
    .long   LPUART5_IRQHandler                              /* LPUART5 interrupt*/
    .long   LPUART6_IRQHandler                              /* LPUART6 interrupt*/
    .long   ASRC_IRQHandler                                 /* ASRC interrupt*/
    .long   BBNSM_IRQHandler                                /* BBNSM iterrupt*/
    .long   SYS_CTRL1_IRQHandler                            /* System Counter compare interrupt 0 and 1*/
    .long   TPM3_IRQHandler                                 /* TPM3 interrupt*/
    .long   TPM4_IRQHandler                                 /* TPM4 interrupt*/
    .long   TPM5_IRQHandler                                 /* TPM5 interrupt*/
    .long   TPM6_IRQHandler                                 /* TPM6 interrupt*/
    .long   RTWDOG3_IRQHandler                              /* RTWDOG3 interrupt*/
    .long   RTWDOG4_IRQHandler                              /* RTWDOG4 interrupt*/
    .long   RTWDOG5_IRQHandler                              /* RTWDOG5 interrupt*/
    .long   Reserved98_IRQHandler                           /* Reserved interrupt*/
    .long   TEMPSENSOR_IRQHandler                           /* TempSensor alarm*/
    .long   Reserved100_IRQHandler                          /* Reserved interrupt*/
    .long   LDO_1P8_IRQHandler                              /* LDO 1P8 interrupt*/
    .long   USDHC1_IRQHandler                               /* USDHC1*/
    .long   USDHC2_IRQHandler                               /* USDHC2*/
    .long   Reserved104_IRQHandler                          /* Reserved interrupt*/
    .long   TMR2_IRQHandler                                 /* TMR2 interrupt*/
    .long   LDO_1P0_IRQHandler                              /* LDO 1P0 interrupt*/
    .long   MECC1_IRQHandler                                /* MECC1 interrupt*/
    .long   MECC2_IRQHandler                                /* MECC2 interrupt*/
    .long   ADC1_IRQHandler                                 /* ADC1 interrupt*/
    .long   DMA_ERROR_IRQHandler                            /* DMA error interrupt*/
    .long   DMA_0_IRQHandler                                /* DMA channel 0 interrupt*/
    .long   DMA_1_IRQHandler                                /* DMA channel 1 interrupt*/
    .long   DMA_2_IRQHandler                                /* DMA channel 2 interrupt*/
    .long   DMA_3_IRQHandler                                /* DMA channel 3 interrupt*/
    .long   DMA_4_IRQHandler                                /* DMA channel 4 interrupt*/
    .long   DMA_5_IRQHandler                                /* DMA channel 5 interrupt*/
    .long   DMA_6_IRQHandler                                /* DMA channel 6 interrupt*/
    .long   DMA_7_IRQHandler                                /* DMA channel 7 interrupt*/
    .long   DMA_8_IRQHandler                                /* DMA channel 8 interrupt*/
    .long   DMA_9_IRQHandler                                /* DMA channel 9 interrupt*/
    .long   DMA_10_IRQHandler                               /* DMA channel 10 interrupt*/
    .long   DMA_11_IRQHandler                               /* DMA channel 11 interrupt*/
    .long   DMA_12_IRQHandler                               /* DMA channel 12 interrupt*/
    .long   DMA_13_IRQHandler                               /* DMA channel 13 interrupt*/
    .long   DMA_14_IRQHandler                               /* DMA channel 14 interrupt*/
    .long   DMA_15_IRQHandler                               /* DMA channel 15 interrupt*/
    .long   DMA_16_IRQHandler                               /* DMA channel 16 interrupt*/
    .long   DMA_17_IRQHandler                               /* DMA channel 17 interrupt*/
    .long   DMA_18_IRQHandler                               /* DMA channel 18 interrupt*/
    .long   DMA_19_IRQHandler                               /* DMA channel 19 interrupt*/
    .long   DMA_20_IRQHandler                               /* DMA channel 20 interrupt*/
    .long   DMA_21_IRQHandler                               /* DMA channel 21 interrupt*/
    .long   DMA_22_IRQHandler                               /* DMA channel 22 interrupt*/
    .long   DMA_23_IRQHandler                               /* DMA channel 23 interrupt*/
    .long   DMA_24_IRQHandler                               /* DMA channel 24 interrupt*/
    .long   DMA_25_IRQHandler                               /* DMA channel 25 interrupt*/
    .long   DMA_26_IRQHandler                               /* DMA channel 26 interrupt*/
    .long   DMA_27_IRQHandler                               /* DMA channel 27 interrupt*/
    .long   DMA_28_IRQHandler                               /* DMA channel 28 interrupt*/
    .long   DMA_29_IRQHandler                               /* DMA channel 29 interrupt*/
    .long   DMA_30_IRQHandler                               /* DMA channel 30 interrupt*/
    .long   DMA_31_IRQHandler                               /* DMA channel 31 interrupt*/
    .long   DMA4_ERROR_IRQHandler                           /* DMA error interrupt*/
    .long   DMA4_0_1_IRQHandler                             /* DMA channel 0/1 interrupt*/
    .long   DMA4_2_3_IRQHandler                             /* DMA channel 2/3 interrupt*/
    .long   DMA4_4_5_IRQHandler                             /* DMA channel 4/5 interrupt*/
    .long   DMA4_6_7_IRQHandler                             /* DMA channel 6/7 interrupt*/
    .long   DMA4_8_9_IRQHandler                             /* DMA channel 8/9 interrupt*/
    .long   DMA4_10_11_IRQHandler                           /* DMA channel 10/11 interrupt*/
    .long   DMA4_12_13_IRQHandler                           /* DMA channel 12/13 interrupt*/
    .long   DMA4_14_15_IRQHandler                           /* DMA channel 14/15 interrupt*/
    .long   DMA4_16_17_IRQHandler                           /* DMA channel 16/17 interrupt*/
    .long   DMA4_18_19_IRQHandler                           /* DMA channel 18/19 interrupt*/
    .long   DMA4_20_21_IRQHandler                           /* DMA channel 20/21 interrupt*/
    .long   DMA4_22_23_IRQHandler                           /* DMA channel 22/23 interrupt*/
    .long   DMA4_24_25_IRQHandler                           /* DMA channel 24/25 interrupt*/
    .long   DMA4_26_27_IRQHandler                           /* DMA channel 26/27 interrupt*/
    .long   DMA4_28_29_IRQHandler                           /* DMA channel 28/29 interrupt*/
    .long   DMA4_30_31_IRQHandler                           /* DMA channel 30/31 interrupt*/
    .long   Reserved160_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved161_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved162_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved163_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved164_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved165_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved166_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved167_IRQHandler                          /* Reserved interrupt*/
    .long   LPI2C5_IRQHandler                               /* LPI2C5 interrupt*/
    .long   LPI2C6_IRQHandler                               /* LPI2C6 interrupt*/
    .long   SAI4_IRQHandler                                 /* SAI4 interrupt*/
    .long   SPDIF_IRQHandler                                /* SPDIF interrupt*/
    .long   LPUART9_IRQHandler                              /* LPUART9 interrupt*/
    .long   LPUART10_IRQHandler                             /* LPUART10 interrupt*/
    .long   LPUART11_IRQHandler                             /* LPUART11 interrupt*/
    .long   LPUART12_IRQHandler                             /* LPUART12 interrupt*/
    .long   Reserved176_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved177_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved178_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved179_IRQHandler                          /* Reserved interrupt*/
    .long   TMR3_IRQHandler                                 /* TMR3 interrupt*/
    .long   TMR4_IRQHandler                                 /* TMR4 interrupt*/
    .long   M33_SYSRESET_REQ_IRQHandler                     /* CM33 SYSREQRST SRC reset source*/
    .long   M33_LOCKUP_IRQHandler                           /* CM33 LOCKUP SRC reset source*/
    .long   M7_SYSRESET_REQ_IRQHandler                      /* CM33 SYSREQRST SRC reset source*/
    .long   M7_LOCKUP_IRQHandler                            /* CM33 LOCKUP SRC reset source*/
    .long   PWM2_FAULT_IRQHandler                           /* PWM2 fault or reload error interrupt*/
    .long   PWM2_0_IRQHandler                               /* PWM2 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM2_1_IRQHandler                               /* PWM2 capture 1, compare 1, or reload 1 interrupt*/
    .long   PWM2_2_IRQHandler                               /* PWM2 capture 2, compare 2, or reload 2 interrupt*/
    .long   PWM2_3_IRQHandler                               /* PWM2 capture 3, compare 3, or reload 3 interrupt*/
    .long   PWM3_FAULT_IRQHandler                           /* PWM3 fault or reload error interrupt*/
    .long   PWM3_0_IRQHandler                               /* PWM3 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM3_1_IRQHandler                               /* PWM3 capture 1, compare 1, or reload 1 interrupt*/
    .long   PWM3_2_IRQHandler                               /* PWM3 capture 2, compare 2, or reload 2 interrupt*/
    .long   PWM3_3_IRQHandler                               /* PWM3 capture 3, compare 3, or reload 3 interrupt*/
    .long   PWM4_FAULT_IRQHandler                           /* PWM4 fault or reload error interrupt*/
    .long   PWM4_0_IRQHandler                               /* PWM4 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM4_1_IRQHandler                               /* PWM4 capture 1, compare 1, or reload 1 interrupt*/
    .long   PWM4_2_IRQHandler                               /* PWM4 capture 2, compare 2, or reload 2 interrupt*/
    .long   PWM4_3_IRQHandler                               /* PWM4 capture 3, compare 3, or reload 3 interrupt*/
    .long   EQDC1_IRQHandler                                /* EQDC1 interrupt*/
    .long   EQDC2_IRQHandler                                /* EQDC2 interrupt*/
    .long   EQDC3_IRQHandler                                /* EQDC3 interrupt*/
    .long   EQDC4_IRQHandler                                /* EQDC4 interrupt*/
    .long   ADC2_IRQHandler                                 /* ADC2 interrupt*/
    .long   DCDC_IRQHandler                                 /* DCDC interrupt*/
    .long   CAN3_IRQHandler                                 /* CAN3 interrupt*/
    .long   CAN3_ERROR_IRQHandler                           /* CAN3 error interrupt*/
    .long   DAC_IRQHandler                                  /* DAC interrupt*/
    .long   LPSPI5_IRQHandler                               /* LPSPI5 interrupt*/
    .long   LPSPI6_IRQHandler                               /* LPSPI6 interrupt*/
    .long   LPUART7_IRQHandler                              /* LPUART7 interrupt*/
    .long   LPUART8_IRQHandler                              /* LPUART8 interrupt*/
    .long   SAI2_IRQHandler                                 /* SAI2 interrupt*/
    .long   SAI3_IRQHandler                                 /* SAI3 interrupt*/
    .long   ACMP1_IRQHandler                                /* CMP1 interrupt*/
    .long   ACMP2_IRQHandler                                /* CMP2 interrupt*/
    .long   ACMP3_IRQHandler                                /* CMP3 interrupt*/
    .long   ACMP4_IRQHandler                                /* CMP4 interrupt*/
    .long   Reserved220_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved221_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved222_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved223_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved224_IRQHandler                          /* Reserved interrupt*/
    .long   GPT1_IRQHandler                                 /* GPT1 interrupt*/
    .long   GPT2_IRQHandler                                 /* GPT2 interrupt*/
    .long   KPP_IRQHandler                                  /* KPP interrupt*/
    .long   USBPHY1_IRQHandler                              /* USBPHY1 interrupt*/
    .long   USBPHY2_IRQHandler                              /* USBPHY2 interrupt*/
    .long   USB_OTG2_IRQHandler                             /* USBOTG2 interrupt*/
    .long   USB_OTG1_IRQHandler                             /* USBOTG1 interrupt*/
    .long   XSPI_SLV_IRQHandler                             /* XSPI_SLV interrupt*/
    .long   NETC_IRQHandler                                 /* NETC interrupt*/
    .long   MSGINTR1_IRQHandler                             /* MSGINTR1 interrupt*/
    .long   MSGINTR2_IRQHandler                             /* MSGINTR2 interrupt*/
    .long   MSGINTR3_IRQHandler                             /* MSGINTR3 interrupt*/
    .long   MSGINTR4_IRQHandler                             /* MSGINTR4 interrupt*/
    .long   MSGINTR5_IRQHandler                             /* MSGINTR5 interrupt*/
    .long   MSGINTR6_IRQHandler                             /* MSGINTR6 interrupt*/
    .long   SINC1_0_IRQHandler                              /* SINC Filter Glue 1 channel 0*/
    .long   SINC1_1_IRQHandler                              /* SINC Filter Glue 1 channel 1*/
    .long   SINC1_2_IRQHandler                              /* SINC Filter Glue 1 channel 2*/
    .long   SINC1_3_IRQHandler                              /* SINC Filter Glue 1 channel 3*/
    .long   SINC2_0_IRQHandler                              /* SINC Filter Glue 2 channel 0*/
    .long   SINC2_1_IRQHandler                              /* SINC Filter Glue 2 channel 1*/
    .long   SINC2_2_IRQHandler                              /* SINC Filter Glue 2 channel 2*/
    .long   SINC2_3_IRQHandler                              /* SINC Filter Glue 2 channel 3*/
    .long   GPIO4_0_IRQHandler                              /* GPIO4 interrupt 0*/
    .long   GPIO4_1_IRQHandler                              /* GPIO4 interrupt 1*/
    .long   GPIO5_0_IRQHandler                              /* GPIO5 interrupt 0*/
    .long   GPIO5_1_IRQHandler                              /* GPIO5 interrupt 1*/
    .long   GPIO6_0_IRQHandler                              /* GPIO6 interrupt 0*/
    .long   GPIO6_1_IRQHandler                              /* GPIO6 interrupt 1*/
    .long   ECAT_IRQHandler                                 /* ECAT interrupt*/
    .long   DefaultISR                                      /* 255*/

    .size    __isr_vector, . - __isr_vector

