NXP/GenAVB_TSN-rtos-apps/devices/MIMXRT118x/common/cm33/armgcc/startup_MIMXRT118x_cm33.S
    .text
    .thumb

/* Reset Handler */

    .thumb_func
    .align 2
    .globl   Reset_Handler
    .weak    Reset_Handler
    .type    Reset_Handler, %function
Reset_Handler:
    cpsid   i               /* Mask interrupts */
    .equ    VTOR, 0xE000ED08
    ldr     r0, =VTOR
    ldr     r1, =__isr_vector
    str     r1, [r0]
    ldr     r2, [r1]
    msr     msp, r2
    ldr     r0, =__StackLimit
    msr     msplim, r0

#ifdef __STARTUP_INITIALIZE_TCM_ECC
/*  After POR, ECC for Code/System TCM memory is enabled by default but not initialized.
 *  Also, the ECC initialization done by boot rom is disabled by fuse configuration.
 *  Zero out all TCM memory to correctly initialize ECC.
 */
    ldr r1, =m_code_tcm_start
    ldr r2, =m_code_tcm_end

    movs    r0, 0
.LC0:
    cmp     r1, r2
    itt    lt
    strlt   r0, [r1], #4
    blt    .LC0

    ldr r1, =m_system_tcm_start
    ldr r2, =m_system_tcm_end

    movs    r0, 0
.LC1:
    cmp     r1, r2
    itt    lt
    strlt   r0, [r1], #4
    blt    .LC1
#endif /* __STARTUP_INITIALIZE_TCM_ECC */

#ifndef __NO_SYSTEM_INIT
    ldr   r0,=SystemInit
    blx   r0
#endif

#ifndef __RAM_BUILD
/*     Loop to copy data from read only memory to RAM. The ranges
 *      of copy from/to are specified by following symbols evaluated in
 *      linker script.
 *      __data_load__: begin of data sections to copy from.
 *      __data_start__/__data_end__: RAM address range that data should be
 *      __noncachedata_start__/__noncachedata_end__ : none cachable region
 *      copied to. Both must be aligned to 4 bytes boundary.  */

    ldr    r1, =__data_load__
    ldr    r2, =__data_start__
    ldr    r3, =__data_end__

#ifdef __PERFORMANCE_IMPLEMENTATION
/* Here are two copies of loop implementations. First one favors performance
 * and the second one favors code size. Default uses the second one.
 * Define macro "__PERFORMANCE_IMPLEMENTATION" in project to use the first one */
    subs    r3, r2
    ble    .LC3
.LC2:
    subs    r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC2
.LC3:
#else  /* code size implemenation */
.LC2:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC2
#endif
#ifdef __STARTUP_INITIALIZE_NONCACHEDATA
    ldr    r2, =__noncachedata_start__
    ldr    r3, =__noncachedata_init_end__
#ifdef __PERFORMANCE_IMPLEMENTATION
/* Here are two copies of loop implementations. First one favors performance
 * and the second one favors code size. Default uses the second one.
 * Define macro "__PERFORMANCE_IMPLEMENTATION" in project to use the first one */
    subs    r3, r2
    ble    .LC5
.LC4:
    subs    r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC4
.LC5:
#else  /* code size implemenation */
.LC4:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC4
#endif
#endif /* __STARTUP_INITIALIZE_NONCACHEDATA */

#ifdef __STARTUP_CLEAR_BSS
/*     This part of work usually is done in C library startup code. Otherwise,
 *     define this macro to enable it in this startup.
 *
 *     Loop to zero out BSS section, which uses following symbols
 *     in linker script:
 *      __START_BSS: start of BSS section. Must align to 4
 *      __END_BSS: end of BSS section. Must align to 4
 */
    ldr    r1, =__START_BSS
    ldr    r2, =__END_BSS

    movs    r0, 0
.LC6:
    cmp     r1, r2
    itt    lt
    strlt   r0, [r1], #4
    blt    .LC6
#endif /* __STARTUP_CLEAR_BSS */

/* zero inited ncache section initialization */
    ldr r2, =__noncachedata_init_end__
    ldr r3, =__noncachedata_end__
    movs    r0,0
.LC7:
    cmp    r2,r3
    itt    lt
    strlt   r0,[r2],#4
    blt    .LC7

/* Copy text from flash to memory */
    ldr    r1, =__text_load
    ldr    r2, =__text_start
    ldr    r3, =__text_end

.LC8:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC8

/* Copy slow text from flash to memory */
    ldr    r1, =__slow_text_load
    ldr    r2, =__slow_text_start
    ldr    r3, =__slow_text_end

.LC9:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC9

/* Clear slow BSS section */
    ldr r1, =__slow_bss_start
    ldr r2, =__slow_bss_end

    movs    r0, 0
.LC10:
    cmp     r1, r2
    itt    lt
    strlt   r0, [r1], #4
    blt    .LC10

/* Relocate vector table */
    ldr    r1, =__isr_vector
    ldr    r2, =__ram_isr_vector_start
    ldr    r3, =__ram_isr_vector_end

.LC11:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC11
#endif /* __RAM_BUILD */

/* We assume that BOARD_Init() code is in code_tcm or ocram
 * If hyperram is enabled, FlexSPI2 is initialized in this function.
 */
    ldr    r0, =BOARD_Init
    blx    r0

#ifndef __RAM_BUILD
#ifdef __HYPERRAM_BUILD
/* Copy hyperram text from flash to memory */
    ldr    r1, =__hyperram_text_load
    ldr    r2, =__hyperram_text_start
    ldr    r3, =__hyperram_text_end

.LC12:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC12

    /* Copy hyperram data from flash to memory */
    ldr    r1, =__hyperram_data_load
    ldr    r2, =__hyperram_data_start
    ldr    r3, =__hyperram_data_end

.LC13:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC13

    /* Clear hyperram BSS section */
    ldr    r1, =__hyperram_bss_start
    ldr    r2, =__hyperram_bss_end

    movs    r0, 0
.LC14:
    cmp     r1, r2
    itt    lt
    strlt   r0, [r1], #4
    blt    .LC14
#endif

/* Update VTOR offset register */
    .equ    VTOR, 0xE000ED08
    ldr     r0, =VTOR
    ldr     r1, =__ram_isr_vector_start
    str     r1, [r0]
#endif /* __RAM_BUILD */

/* Add stack / heap initializaiton */
    movs    r0, 0
    ldr     r1, =__HeapBase
    ldr     r2, =__HeapLimit
.LC15:
    cmp     r1, r2
    itt     lt
    strlt   r0, [r1], #4
    blt     .LC15

    ldr     r1, =__StackLimit
    ldr     r2, =__StackTop
.LC16:
    cmp     r1, r2
    itt     lt
    strlt   r0, [r1], #4
    blt     .LC16

    cpsie   i               /* Unmask interrupts */
#ifndef __START
#define __START _start
#endif
#ifndef __ATOLLIC__
    ldr   r0,=__START
    blx   r0
#else
    ldr   r0,=__libc_init_array
    blx   r0
    ldr   r0,=main
    bx    r0
#endif
    .pool
    .size Reset_Handler, . - Reset_Handler

