NXP/GenAVB_TSN-rtos-apps/devices/MIMXRT118x/common/cm33/armgcc/startup_MIMXRT118x_cm33.S
    .align  1
    .thumb_func
    .weak DefaultISR
    .type DefaultISR, %function
DefaultISR:
    b DefaultISR
    .size DefaultISR, . - DefaultISR

    .align 1
    .thumb_func
    .weak NMI_Handler
    .type NMI_Handler, %function
NMI_Handler:
    ldr   r0,=NMI_Handler
    bx    r0
    .size NMI_Handler, . - NMI_Handler

    .align 1
    .thumb_func
    .type Fault_Handler, %function
Fault_Handler:
# On exception entry, lr has control information and bit 3 tells if return will
# occur using main or process stack
# See Armv8-M RM section D1.2.95
    tst     lr, #4
    ite     eq
    mrseq   r0, msp
    mrsne   r0, psp
# encode exception number in r1, second argument
    mrs     r1, ipsr
    ldr     r2,=Fault_Dispatcher
    bx      r2

    .align 1
    .thumb_func
    .weak SVC_Handler
    .type SVC_Handler, %function
SVC_Handler:
    ldr   r0,=SVC_Handler
    bx    r0
    .size SVC_Handler, . - SVC_Handler

    .align 1
    .thumb_func
    .weak PendSV_Handler
    .type PendSV_Handler, %function
PendSV_Handler:
    ldr   r0,=PendSV_Handler
    bx    r0
    .size PendSV_Handler, . - PendSV_Handler

    .align 1
    .thumb_func
    .weak SysTick_Handler
    .type SysTick_Handler, %function
SysTick_Handler:
    ldr   r0,=SysTick_Handler
    bx    r0
    .size SysTick_Handler, . - SysTick_Handler

    .align 1
    .thumb_func
    .weak CAN1_IRQHandler
    .type CAN1_IRQHandler, %function
CAN1_IRQHandler:
    ldr   r0,=CAN1_DriverIRQHandler
    bx    r0
    .size CAN1_IRQHandler, . - CAN1_IRQHandler

    .align 1
    .thumb_func
    .weak CAN1_ERROR_IRQHandler
    .type CAN1_ERROR_IRQHandler, %function
CAN1_ERROR_IRQHandler:
    ldr   r0,=CAN1_ERROR_DriverIRQHandler
    bx    r0
    .size CAN1_ERROR_IRQHandler, . - CAN1_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak I3C1_IRQHandler
    .type I3C1_IRQHandler, %function
I3C1_IRQHandler:
    ldr   r0,=I3C1_DriverIRQHandler
    bx    r0
    .size I3C1_IRQHandler, . - I3C1_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C1_IRQHandler
    .type LPI2C1_IRQHandler, %function
LPI2C1_IRQHandler:
    ldr   r0,=LPI2C1_DriverIRQHandler
    bx    r0
    .size LPI2C1_IRQHandler, . - LPI2C1_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C2_IRQHandler
    .type LPI2C2_IRQHandler, %function
LPI2C2_IRQHandler:
    ldr   r0,=LPI2C2_DriverIRQHandler
    bx    r0
    .size LPI2C2_IRQHandler, . - LPI2C2_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI1_IRQHandler
    .type LPSPI1_IRQHandler, %function
LPSPI1_IRQHandler:
    ldr   r0,=LPSPI1_DriverIRQHandler
    bx    r0
    .size LPSPI1_IRQHandler, . - LPSPI1_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI2_IRQHandler
    .type LPSPI2_IRQHandler, %function
LPSPI2_IRQHandler:
    ldr   r0,=LPSPI2_DriverIRQHandler
    bx    r0
    .size LPSPI2_IRQHandler, . - LPSPI2_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART1_IRQHandler
    .type LPUART1_IRQHandler, %function
LPUART1_IRQHandler:
    ldr   r0,=LPUART1_DriverIRQHandler
    bx    r0
    .size LPUART1_IRQHandler, . - LPUART1_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART2_IRQHandler
    .type LPUART2_IRQHandler, %function
LPUART2_IRQHandler:
    ldr   r0,=LPUART2_DriverIRQHandler
    bx    r0
    .size LPUART2_IRQHandler, . - LPUART2_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_HWVAD_EVENT_IRQHandler
    .type PDM_HWVAD_EVENT_IRQHandler, %function
PDM_HWVAD_EVENT_IRQHandler:
    ldr   r0,=PDM_HWVAD_EVENT_DriverIRQHandler
    bx    r0
    .size PDM_HWVAD_EVENT_IRQHandler, . - PDM_HWVAD_EVENT_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_HWVAD_ERROR_IRQHandler
    .type PDM_HWVAD_ERROR_IRQHandler, %function
PDM_HWVAD_ERROR_IRQHandler:
    ldr   r0,=PDM_HWVAD_ERROR_DriverIRQHandler
    bx    r0
    .size PDM_HWVAD_ERROR_IRQHandler, . - PDM_HWVAD_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_EVENT_IRQHandler
    .type PDM_EVENT_IRQHandler, %function
PDM_EVENT_IRQHandler:
    ldr   r0,=PDM_EVENT_DriverIRQHandler
    bx    r0
    .size PDM_EVENT_IRQHandler, . - PDM_EVENT_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_ERROR_IRQHandler
    .type PDM_ERROR_IRQHandler, %function
PDM_ERROR_IRQHandler:
    ldr   r0,=PDM_ERROR_DriverIRQHandler
    bx    r0
    .size PDM_ERROR_IRQHandler, . - PDM_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak SAI1_IRQHandler
    .type SAI1_IRQHandler, %function
SAI1_IRQHandler:
    ldr   r0,=SAI1_DriverIRQHandler
    bx    r0
    .size SAI1_IRQHandler, . - SAI1_IRQHandler

    .align 1
    .thumb_func
    .weak CAN2_IRQHandler
    .type CAN2_IRQHandler, %function
CAN2_IRQHandler:
    ldr   r0,=CAN2_DriverIRQHandler
    bx    r0
    .size CAN2_IRQHandler, . - CAN2_IRQHandler

    .align 1
    .thumb_func
    .weak CAN2_ERROR_IRQHandler
    .type CAN2_ERROR_IRQHandler, %function
CAN2_ERROR_IRQHandler:
    ldr   r0,=CAN2_ERROR_DriverIRQHandler
    bx    r0
    .size CAN2_ERROR_IRQHandler, . - CAN2_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXIO1_IRQHandler
    .type FLEXIO1_IRQHandler, %function
FLEXIO1_IRQHandler:
    ldr   r0,=FLEXIO1_DriverIRQHandler
    bx    r0
    .size FLEXIO1_IRQHandler, . - FLEXIO1_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXIO2_IRQHandler
    .type FLEXIO2_IRQHandler, %function
FLEXIO2_IRQHandler:
    ldr   r0,=FLEXIO2_DriverIRQHandler
    bx    r0
    .size FLEXIO2_IRQHandler, . - FLEXIO2_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXSPI1_IRQHandler
    .type FLEXSPI1_IRQHandler, %function
FLEXSPI1_IRQHandler:
    ldr   r0,=FLEXSPI1_DriverIRQHandler
    bx    r0
    .size FLEXSPI1_IRQHandler, . - FLEXSPI1_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXSPI2_IRQHandler
    .type FLEXSPI2_IRQHandler, %function
FLEXSPI2_IRQHandler:
    ldr   r0,=FLEXSPI2_DriverIRQHandler
    bx    r0
    .size FLEXSPI2_IRQHandler, . - FLEXSPI2_IRQHandler

    .align 1
    .thumb_func
    .weak I3C2_IRQHandler
    .type I3C2_IRQHandler, %function
I3C2_IRQHandler:
    ldr   r0,=I3C2_DriverIRQHandler
    bx    r0
    .size I3C2_IRQHandler, . - I3C2_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C3_IRQHandler
    .type LPI2C3_IRQHandler, %function
LPI2C3_IRQHandler:
    ldr   r0,=LPI2C3_DriverIRQHandler
    bx    r0
    .size LPI2C3_IRQHandler, . - LPI2C3_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C4_IRQHandler
    .type LPI2C4_IRQHandler, %function
LPI2C4_IRQHandler:
    ldr   r0,=LPI2C4_DriverIRQHandler
    bx    r0
    .size LPI2C4_IRQHandler, . - LPI2C4_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI3_IRQHandler
    .type LPSPI3_IRQHandler, %function
LPSPI3_IRQHandler:
    ldr   r0,=LPSPI3_DriverIRQHandler
    bx    r0
    .size LPSPI3_IRQHandler, . - LPSPI3_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI4_IRQHandler
    .type LPSPI4_IRQHandler, %function
LPSPI4_IRQHandler:
    ldr   r0,=LPSPI4_DriverIRQHandler
    bx    r0
    .size LPSPI4_IRQHandler, . - LPSPI4_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART3_IRQHandler
    .type LPUART3_IRQHandler, %function
LPUART3_IRQHandler:
    ldr   r0,=LPUART3_DriverIRQHandler
    bx    r0
    .size LPUART3_IRQHandler, . - LPUART3_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART4_IRQHandler
    .type LPUART4_IRQHandler, %function
LPUART4_IRQHandler:
    ldr   r0,=LPUART4_DriverIRQHandler
    bx    r0
    .size LPUART4_IRQHandler, . - LPUART4_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART5_IRQHandler
    .type LPUART5_IRQHandler, %function
LPUART5_IRQHandler:
    ldr   r0,=LPUART5_DriverIRQHandler
    bx    r0
    .size LPUART5_IRQHandler, . - LPUART5_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART6_IRQHandler
    .type LPUART6_IRQHandler, %function
LPUART6_IRQHandler:
    ldr   r0,=LPUART6_DriverIRQHandler
    bx    r0
    .size LPUART6_IRQHandler, . - LPUART6_IRQHandler

    .align 1
    .thumb_func
    .weak ASRC_IRQHandler
    .type ASRC_IRQHandler, %function
ASRC_IRQHandler:
    ldr   r0,=ASRC_DriverIRQHandler
    bx    r0
    .size ASRC_IRQHandler, . - ASRC_IRQHandler

    .align 1
    .thumb_func
    .weak USDHC1_IRQHandler
    .type USDHC1_IRQHandler, %function
USDHC1_IRQHandler:
    ldr   r0,=USDHC1_DriverIRQHandler
    bx    r0
    .size USDHC1_IRQHandler, . - USDHC1_IRQHandler

    .align 1
    .thumb_func
    .weak USDHC2_IRQHandler
    .type USDHC2_IRQHandler, %function
USDHC2_IRQHandler:
    ldr   r0,=USDHC2_DriverIRQHandler
    bx    r0
    .size USDHC2_IRQHandler, . - USDHC2_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_ERROR_IRQHandler
    .type DMA_ERROR_IRQHandler, %function
DMA_ERROR_IRQHandler:
    ldr   r0,=DMA_ERROR_DriverIRQHandler
    bx    r0
    .size DMA_ERROR_IRQHandler, . - DMA_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_0_IRQHandler
    .type DMA_0_IRQHandler, %function
DMA_0_IRQHandler:
    ldr   r0,=DMA_0_DriverIRQHandler
    bx    r0
    .size DMA_0_IRQHandler, . - DMA_0_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_1_IRQHandler
    .type DMA_1_IRQHandler, %function
DMA_1_IRQHandler:
    ldr   r0,=DMA_1_DriverIRQHandler
    bx    r0
    .size DMA_1_IRQHandler, . - DMA_1_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_2_IRQHandler
    .type DMA_2_IRQHandler, %function
DMA_2_IRQHandler:
    ldr   r0,=DMA_2_DriverIRQHandler
    bx    r0
    .size DMA_2_IRQHandler, . - DMA_2_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_3_IRQHandler
    .type DMA_3_IRQHandler, %function
DMA_3_IRQHandler:
    ldr   r0,=DMA_3_DriverIRQHandler
    bx    r0
    .size DMA_3_IRQHandler, . - DMA_3_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_4_IRQHandler
    .type DMA_4_IRQHandler, %function
DMA_4_IRQHandler:
    ldr   r0,=DMA_4_DriverIRQHandler
    bx    r0
    .size DMA_4_IRQHandler, . - DMA_4_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_5_IRQHandler
    .type DMA_5_IRQHandler, %function
DMA_5_IRQHandler:
    ldr   r0,=DMA_5_DriverIRQHandler
    bx    r0
    .size DMA_5_IRQHandler, . - DMA_5_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_6_IRQHandler
    .type DMA_6_IRQHandler, %function
DMA_6_IRQHandler:
    ldr   r0,=DMA_6_DriverIRQHandler
    bx    r0
    .size DMA_6_IRQHandler, . - DMA_6_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_7_IRQHandler
    .type DMA_7_IRQHandler, %function
DMA_7_IRQHandler:
    ldr   r0,=DMA_7_DriverIRQHandler
    bx    r0
    .size DMA_7_IRQHandler, . - DMA_7_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_8_IRQHandler
    .type DMA_8_IRQHandler, %function
DMA_8_IRQHandler:
    ldr   r0,=DMA_8_DriverIRQHandler
    bx    r0
    .size DMA_8_IRQHandler, . - DMA_8_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_9_IRQHandler
    .type DMA_9_IRQHandler, %function
DMA_9_IRQHandler:
    ldr   r0,=DMA_9_DriverIRQHandler
    bx    r0
    .size DMA_9_IRQHandler, . - DMA_9_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_10_IRQHandler
    .type DMA_10_IRQHandler, %function
DMA_10_IRQHandler:
    ldr   r0,=DMA_10_DriverIRQHandler
    bx    r0
    .size DMA_10_IRQHandler, . - DMA_10_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_11_IRQHandler
    .type DMA_11_IRQHandler, %function
DMA_11_IRQHandler:
    ldr   r0,=DMA_11_DriverIRQHandler
    bx    r0
    .size DMA_11_IRQHandler, . - DMA_11_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_12_IRQHandler
    .type DMA_12_IRQHandler, %function
DMA_12_IRQHandler:
    ldr   r0,=DMA_12_DriverIRQHandler
    bx    r0
    .size DMA_12_IRQHandler, . - DMA_12_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_13_IRQHandler
    .type DMA_13_IRQHandler, %function
DMA_13_IRQHandler:
    ldr   r0,=DMA_13_DriverIRQHandler
    bx    r0
    .size DMA_13_IRQHandler, . - DMA_13_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_14_IRQHandler
    .type DMA_14_IRQHandler, %function
DMA_14_IRQHandler:
    ldr   r0,=DMA_14_DriverIRQHandler
    bx    r0
    .size DMA_14_IRQHandler, . - DMA_14_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_15_IRQHandler
    .type DMA_15_IRQHandler, %function
DMA_15_IRQHandler:
    ldr   r0,=DMA_15_DriverIRQHandler
    bx    r0
    .size DMA_15_IRQHandler, . - DMA_15_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_16_IRQHandler
    .type DMA_16_IRQHandler, %function
DMA_16_IRQHandler:
    ldr   r0,=DMA_16_DriverIRQHandler
    bx    r0
    .size DMA_16_IRQHandler, . - DMA_16_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_17_IRQHandler
    .type DMA_17_IRQHandler, %function
DMA_17_IRQHandler:
    ldr   r0,=DMA_17_DriverIRQHandler
    bx    r0
    .size DMA_17_IRQHandler, . - DMA_17_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_18_IRQHandler
    .type DMA_18_IRQHandler, %function
DMA_18_IRQHandler:
    ldr   r0,=DMA_18_DriverIRQHandler
    bx    r0
    .size DMA_18_IRQHandler, . - DMA_18_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_19_IRQHandler
    .type DMA_19_IRQHandler, %function
DMA_19_IRQHandler:
    ldr   r0,=DMA_19_DriverIRQHandler
    bx    r0
    .size DMA_19_IRQHandler, . - DMA_19_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_20_IRQHandler
    .type DMA_20_IRQHandler, %function
DMA_20_IRQHandler:
    ldr   r0,=DMA_20_DriverIRQHandler
    bx    r0
    .size DMA_20_IRQHandler, . - DMA_20_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_21_IRQHandler
    .type DMA_21_IRQHandler, %function
DMA_21_IRQHandler:
    ldr   r0,=DMA_21_DriverIRQHandler
    bx    r0
    .size DMA_21_IRQHandler, . - DMA_21_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_22_IRQHandler
    .type DMA_22_IRQHandler, %function
DMA_22_IRQHandler:
    ldr   r0,=DMA_22_DriverIRQHandler
    bx    r0
    .size DMA_22_IRQHandler, . - DMA_22_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_23_IRQHandler
    .type DMA_23_IRQHandler, %function
DMA_23_IRQHandler:
    ldr   r0,=DMA_23_DriverIRQHandler
    bx    r0
    .size DMA_23_IRQHandler, . - DMA_23_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_24_IRQHandler
    .type DMA_24_IRQHandler, %function
DMA_24_IRQHandler:
    ldr   r0,=DMA_24_DriverIRQHandler
    bx    r0
    .size DMA_24_IRQHandler, . - DMA_24_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_25_IRQHandler
    .type DMA_25_IRQHandler, %function
DMA_25_IRQHandler:
    ldr   r0,=DMA_25_DriverIRQHandler
    bx    r0
    .size DMA_25_IRQHandler, . - DMA_25_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_26_IRQHandler
    .type DMA_26_IRQHandler, %function
DMA_26_IRQHandler:
    ldr   r0,=DMA_26_DriverIRQHandler
    bx    r0
    .size DMA_26_IRQHandler, . - DMA_26_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_27_IRQHandler
    .type DMA_27_IRQHandler, %function
DMA_27_IRQHandler:
    ldr   r0,=DMA_27_DriverIRQHandler
    bx    r0
    .size DMA_27_IRQHandler, . - DMA_27_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_28_IRQHandler
    .type DMA_28_IRQHandler, %function
DMA_28_IRQHandler:
    ldr   r0,=DMA_28_DriverIRQHandler
    bx    r0
    .size DMA_28_IRQHandler, . - DMA_28_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_29_IRQHandler
    .type DMA_29_IRQHandler, %function
DMA_29_IRQHandler:
    ldr   r0,=DMA_29_DriverIRQHandler
    bx    r0
    .size DMA_29_IRQHandler, . - DMA_29_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_30_IRQHandler
    .type DMA_30_IRQHandler, %function
DMA_30_IRQHandler:
    ldr   r0,=DMA_30_DriverIRQHandler
    bx    r0
    .size DMA_30_IRQHandler, . - DMA_30_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_31_IRQHandler
    .type DMA_31_IRQHandler, %function
DMA_31_IRQHandler:
    ldr   r0,=DMA_31_DriverIRQHandler
    bx    r0
    .size DMA_31_IRQHandler, . - DMA_31_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_ERROR_IRQHandler
    .type DMA4_ERROR_IRQHandler, %function
DMA4_ERROR_IRQHandler:
    ldr   r0,=DMA4_ERROR_DriverIRQHandler
    bx    r0
    .size DMA4_ERROR_IRQHandler, . - DMA4_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_0_1_IRQHandler
    .type DMA4_0_1_IRQHandler, %function
DMA4_0_1_IRQHandler:
    ldr   r0,=DMA4_0_1_DriverIRQHandler
    bx    r0
    .size DMA4_0_1_IRQHandler, . - DMA4_0_1_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_2_3_IRQHandler
    .type DMA4_2_3_IRQHandler, %function
DMA4_2_3_IRQHandler:
    ldr   r0,=DMA4_2_3_DriverIRQHandler
    bx    r0
    .size DMA4_2_3_IRQHandler, . - DMA4_2_3_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_4_5_IRQHandler
    .type DMA4_4_5_IRQHandler, %function
DMA4_4_5_IRQHandler:
    ldr   r0,=DMA4_4_5_DriverIRQHandler
    bx    r0
    .size DMA4_4_5_IRQHandler, . - DMA4_4_5_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_6_7_IRQHandler
    .type DMA4_6_7_IRQHandler, %function
DMA4_6_7_IRQHandler:
    ldr   r0,=DMA4_6_7_DriverIRQHandler
    bx    r0
    .size DMA4_6_7_IRQHandler, . - DMA4_6_7_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_8_9_IRQHandler
    .type DMA4_8_9_IRQHandler, %function
DMA4_8_9_IRQHandler:
    ldr   r0,=DMA4_8_9_DriverIRQHandler
    bx    r0
    .size DMA4_8_9_IRQHandler, . - DMA4_8_9_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_10_11_IRQHandler
    .type DMA4_10_11_IRQHandler, %function
DMA4_10_11_IRQHandler:
    ldr   r0,=DMA4_10_11_DriverIRQHandler
    bx    r0
    .size DMA4_10_11_IRQHandler, . - DMA4_10_11_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_12_13_IRQHandler
    .type DMA4_12_13_IRQHandler, %function
DMA4_12_13_IRQHandler:
    ldr   r0,=DMA4_12_13_DriverIRQHandler
    bx    r0
    .size DMA4_12_13_IRQHandler, . - DMA4_12_13_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_14_15_IRQHandler
    .type DMA4_14_15_IRQHandler, %function
DMA4_14_15_IRQHandler:
    ldr   r0,=DMA4_14_15_DriverIRQHandler
    bx    r0
    .size DMA4_14_15_IRQHandler, . - DMA4_14_15_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_16_17_IRQHandler
    .type DMA4_16_17_IRQHandler, %function
DMA4_16_17_IRQHandler:
    ldr   r0,=DMA4_16_17_DriverIRQHandler
    bx    r0
    .size DMA4_16_17_IRQHandler, . - DMA4_16_17_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_18_19_IRQHandler
    .type DMA4_18_19_IRQHandler, %function
DMA4_18_19_IRQHandler:
    ldr   r0,=DMA4_18_19_DriverIRQHandler
    bx    r0
    .size DMA4_18_19_IRQHandler, . - DMA4_18_19_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_20_21_IRQHandler
    .type DMA4_20_21_IRQHandler, %function
DMA4_20_21_IRQHandler:
    ldr   r0,=DMA4_20_21_DriverIRQHandler
    bx    r0
    .size DMA4_20_21_IRQHandler, . - DMA4_20_21_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_22_23_IRQHandler
    .type DMA4_22_23_IRQHandler, %function
DMA4_22_23_IRQHandler:
    ldr   r0,=DMA4_22_23_DriverIRQHandler
    bx    r0
    .size DMA4_22_23_IRQHandler, . - DMA4_22_23_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_24_25_IRQHandler
    .type DMA4_24_25_IRQHandler, %function
DMA4_24_25_IRQHandler:
    ldr   r0,=DMA4_24_25_DriverIRQHandler
    bx    r0
    .size DMA4_24_25_IRQHandler, . - DMA4_24_25_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_26_27_IRQHandler
    .type DMA4_26_27_IRQHandler, %function
DMA4_26_27_IRQHandler:
    ldr   r0,=DMA4_26_27_DriverIRQHandler
    bx    r0
    .size DMA4_26_27_IRQHandler, . - DMA4_26_27_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_28_29_IRQHandler
    .type DMA4_28_29_IRQHandler, %function
DMA4_28_29_IRQHandler:
    ldr   r0,=DMA4_28_29_DriverIRQHandler
    bx    r0
    .size DMA4_28_29_IRQHandler, . - DMA4_28_29_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_30_31_IRQHandler
    .type DMA4_30_31_IRQHandler, %function
DMA4_30_31_IRQHandler:
    ldr   r0,=DMA4_30_31_DriverIRQHandler
    bx    r0
    .size DMA4_30_31_IRQHandler, . - DMA4_30_31_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C5_IRQHandler
    .type LPI2C5_IRQHandler, %function
LPI2C5_IRQHandler:
    ldr   r0,=LPI2C5_DriverIRQHandler
    bx    r0
    .size LPI2C5_IRQHandler, . - LPI2C5_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C6_IRQHandler
    .type LPI2C6_IRQHandler, %function
LPI2C6_IRQHandler:
    ldr   r0,=LPI2C6_DriverIRQHandler
    bx    r0
    .size LPI2C6_IRQHandler, . - LPI2C6_IRQHandler

    .align 1
    .thumb_func
    .weak SAI4_IRQHandler
    .type SAI4_IRQHandler, %function
SAI4_IRQHandler:
    ldr   r0,=SAI4_DriverIRQHandler
    bx    r0
    .size SAI4_IRQHandler, . - SAI4_IRQHandler

    .align 1
    .thumb_func
    .weak SPDIF_IRQHandler
    .type SPDIF_IRQHandler, %function
SPDIF_IRQHandler:
    ldr   r0,=SPDIF_DriverIRQHandler
    bx    r0
    .size SPDIF_IRQHandler, . - SPDIF_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART9_IRQHandler
    .type LPUART9_IRQHandler, %function
LPUART9_IRQHandler:
    ldr   r0,=LPUART9_DriverIRQHandler
    bx    r0
    .size LPUART9_IRQHandler, . - LPUART9_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART10_IRQHandler
    .type LPUART10_IRQHandler, %function
LPUART10_IRQHandler:
    ldr   r0,=LPUART10_DriverIRQHandler
    bx    r0
    .size LPUART10_IRQHandler, . - LPUART10_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART11_IRQHandler
    .type LPUART11_IRQHandler, %function
LPUART11_IRQHandler:
    ldr   r0,=LPUART11_DriverIRQHandler
    bx    r0
    .size LPUART11_IRQHandler, . - LPUART11_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART12_IRQHandler
    .type LPUART12_IRQHandler, %function
LPUART12_IRQHandler:
    ldr   r0,=LPUART12_DriverIRQHandler
    bx    r0
    .size LPUART12_IRQHandler, . - LPUART12_IRQHandler

    .align 1
    .thumb_func
    .weak CAN3_IRQHandler
    .type CAN3_IRQHandler, %function
CAN3_IRQHandler:
    ldr   r0,=CAN3_DriverIRQHandler
    bx    r0
    .size CAN3_IRQHandler, . - CAN3_IRQHandler

    .align 1
    .thumb_func
    .weak CAN3_ERROR_IRQHandler
    .type CAN3_ERROR_IRQHandler, %function
CAN3_ERROR_IRQHandler:
    ldr   r0,=CAN3_ERROR_DriverIRQHandler
    bx    r0
    .size CAN3_ERROR_IRQHandler, . - CAN3_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI5_IRQHandler
    .type LPSPI5_IRQHandler, %function
LPSPI5_IRQHandler:
    ldr   r0,=LPSPI5_DriverIRQHandler
    bx    r0
    .size LPSPI5_IRQHandler, . - LPSPI5_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI6_IRQHandler
    .type LPSPI6_IRQHandler, %function
LPSPI6_IRQHandler:
    ldr   r0,=LPSPI6_DriverIRQHandler
    bx    r0
    .size LPSPI6_IRQHandler, . - LPSPI6_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART7_IRQHandler
    .type LPUART7_IRQHandler, %function
LPUART7_IRQHandler:
    ldr   r0,=LPUART7_DriverIRQHandler
    bx    r0
    .size LPUART7_IRQHandler, . - LPUART7_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART8_IRQHandler
    .type LPUART8_IRQHandler, %function
LPUART8_IRQHandler:
    ldr   r0,=LPUART8_DriverIRQHandler
    bx    r0
    .size LPUART8_IRQHandler, . - LPUART8_IRQHandler

    .align 1
    .thumb_func
    .weak SAI2_IRQHandler
    .type SAI2_IRQHandler, %function
SAI2_IRQHandler:
    ldr   r0,=SAI2_DriverIRQHandler
    bx    r0
    .size SAI2_IRQHandler, . - SAI2_IRQHandler

    .align 1
    .thumb_func
    .weak SAI3_IRQHandler
    .type SAI3_IRQHandler, %function
SAI3_IRQHandler:
    ldr   r0,=SAI3_DriverIRQHandler
    bx    r0
    .size SAI3_IRQHandler, . - SAI3_IRQHandler

    .align 1
    .thumb_func
    .weak XSPI_SLV_IRQHandler
    .type XSPI_SLV_IRQHandler, %function
XSPI_SLV_IRQHandler:
    ldr   r0,=XSPI_SLV_DriverIRQHandler
    bx    r0
    .size XSPI_SLV_IRQHandler, . - XSPI_SLV_IRQHandler


