NXP/GenAVB_TSN-rtos-apps/devices/MIMXRT118x/common/cm33/armgcc/startup_MIMXRT118x_cm33.S
/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro def_irq_handler  handler_name
    .weak \handler_name
    .set  \handler_name, DefaultISR
    .endm

/* Exception Handlers */
    def_irq_handler    DebugMon_Handler
    def_irq_handler    TMR1_IRQHandler
    def_irq_handler    DAP_IRQHandler
    def_irq_handler    M7_CTI_TRIGGER_OUTPUT_IRQHandler
    def_irq_handler    M33_CTI_TRIGGER_OUTPUT_IRQHandler
    def_irq_handler    TMR5_IRQHandler
    def_irq_handler    TMR6_IRQHandler
    def_irq_handler    TMR7_IRQHandler
    def_irq_handler    TMR8_IRQHandler
    def_irq_handler    CAN1_DriverIRQHandler
    def_irq_handler    CAN1_ERROR_DriverIRQHandler
    def_irq_handler    GPIO1_0_IRQHandler
    def_irq_handler    GPIO1_1_IRQHandler
    def_irq_handler    I3C1_DriverIRQHandler
    def_irq_handler    LPI2C1_DriverIRQHandler
    def_irq_handler    LPI2C2_DriverIRQHandler
    def_irq_handler    LPIT1_IRQHandler
    def_irq_handler    LPSPI1_DriverIRQHandler
    def_irq_handler    LPSPI2_DriverIRQHandler
    def_irq_handler    LPTMR1_IRQHandler
    def_irq_handler    LPUART1_DriverIRQHandler
    def_irq_handler    LPUART2_DriverIRQHandler
    def_irq_handler    MU1_IRQHandler
    def_irq_handler    MU2_IRQHandler
    def_irq_handler    PWM1_FAULT_IRQHandler
    def_irq_handler    PWM1_0_IRQHandler
    def_irq_handler    PWM1_1_IRQHandler
    def_irq_handler    PWM1_2_IRQHandler
    def_irq_handler    PWM1_3_IRQHandler
    def_irq_handler    SENTINEL_TRUST_MUA_RX_FULL_IRQHandler
    def_irq_handler    SENTINEL_TRUST_MUA_TX_EMPTY_IRQHandler
    def_irq_handler    SENTINEL_APPS_CORE_MUA_RX_FULL_IRQHandler
    def_irq_handler    SENTINEL_APPS_CORE_MUA_TX_EMPTY_IRQHandler
    def_irq_handler    SENTINEL_REALTIME_CORE_MUA_RX_FULL_IRQHandler
    def_irq_handler    SENTINEL_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler
    def_irq_handler    SENTINEL_SECURE_IRQHandler
    def_irq_handler    SENTINEL_NONSECURE_IRQHandler
    def_irq_handler    TPM1_IRQHandler
    def_irq_handler    TPM2_IRQHandler
    def_irq_handler    RTWDOG1_IRQHandler
    def_irq_handler    RTWDOG2_IRQHandler
    def_irq_handler    Reserved56_IRQHandler
    def_irq_handler    PDM_HWVAD_EVENT_DriverIRQHandler
    def_irq_handler    PDM_HWVAD_ERROR_DriverIRQHandler
    def_irq_handler    PDM_EVENT_DriverIRQHandler
    def_irq_handler    PDM_ERROR_DriverIRQHandler
    def_irq_handler    SAI1_DriverIRQHandler
    def_irq_handler    M33_PS_IRQHandler
    def_irq_handler    M33_TCM_ECC_IRQHandler
    def_irq_handler    M33_TCM_ERROR_IRQHandler
    def_irq_handler    M7_TCM_ECC_IRQHandler
    def_irq_handler    M7_TCM_ERROR_IRQHandler
    def_irq_handler    CAN2_DriverIRQHandler
    def_irq_handler    CAN2_ERROR_DriverIRQHandler
    def_irq_handler    FLEXIO1_DriverIRQHandler
    def_irq_handler    FLEXIO2_DriverIRQHandler
    def_irq_handler    FLEXSPI1_DriverIRQHandler
    def_irq_handler    FLEXSPI2_DriverIRQHandler
    def_irq_handler    GPIO2_0_IRQHandler
    def_irq_handler    GPIO2_1_IRQHandler
    def_irq_handler    GPIO3_0_IRQHandler
    def_irq_handler    GPIO3_1_IRQHandler
    def_irq_handler    I3C2_DriverIRQHandler
    def_irq_handler    LPI2C3_DriverIRQHandler
    def_irq_handler    LPI2C4_DriverIRQHandler
    def_irq_handler    LPIT2_IRQHandler
    def_irq_handler    LPSPI3_DriverIRQHandler
    def_irq_handler    LPSPI4_DriverIRQHandler
    def_irq_handler    LPTMR2_IRQHandler
    def_irq_handler    LPUART3_DriverIRQHandler
    def_irq_handler    LPUART4_DriverIRQHandler
    def_irq_handler    LPUART5_DriverIRQHandler
    def_irq_handler    LPUART6_DriverIRQHandler
    def_irq_handler    ASRC_DriverIRQHandler
    def_irq_handler    BBNSM_IRQHandler
    def_irq_handler    SYS_CTRL1_IRQHandler
    def_irq_handler    TPM3_IRQHandler
    def_irq_handler    TPM4_IRQHandler
    def_irq_handler    TPM5_IRQHandler
    def_irq_handler    TPM6_IRQHandler
    def_irq_handler    RTWDOG3_IRQHandler
    def_irq_handler    RTWDOG4_IRQHandler
    def_irq_handler    RTWDOG5_IRQHandler
    def_irq_handler    Reserved98_IRQHandler
    def_irq_handler    TEMPSENSOR_IRQHandler
    def_irq_handler    Reserved100_IRQHandler
    def_irq_handler    LDO_1P8_IRQHandler
    def_irq_handler    USDHC1_DriverIRQHandler
    def_irq_handler    USDHC2_DriverIRQHandler
    def_irq_handler    Reserved104_IRQHandler
    def_irq_handler    TMR2_IRQHandler
    def_irq_handler    LDO_1P0_IRQHandler
    def_irq_handler    MECC1_IRQHandler
    def_irq_handler    MECC2_IRQHandler
    def_irq_handler    ADC1_IRQHandler
    def_irq_handler    DMA_ERROR_DriverIRQHandler
    def_irq_handler    DMA_0_DriverIRQHandler
    def_irq_handler    DMA_1_DriverIRQHandler
    def_irq_handler    DMA_2_DriverIRQHandler
    def_irq_handler    DMA_3_DriverIRQHandler
    def_irq_handler    DMA_4_DriverIRQHandler
    def_irq_handler    DMA_5_DriverIRQHandler
    def_irq_handler    DMA_6_DriverIRQHandler
    def_irq_handler    DMA_7_DriverIRQHandler
    def_irq_handler    DMA_8_DriverIRQHandler
    def_irq_handler    DMA_9_DriverIRQHandler
    def_irq_handler    DMA_10_DriverIRQHandler
    def_irq_handler    DMA_11_DriverIRQHandler
    def_irq_handler    DMA_12_DriverIRQHandler
    def_irq_handler    DMA_13_DriverIRQHandler
    def_irq_handler    DMA_14_DriverIRQHandler
    def_irq_handler    DMA_15_DriverIRQHandler
    def_irq_handler    DMA_16_DriverIRQHandler
    def_irq_handler    DMA_17_DriverIRQHandler
    def_irq_handler    DMA_18_DriverIRQHandler
    def_irq_handler    DMA_19_DriverIRQHandler
    def_irq_handler    DMA_20_DriverIRQHandler
    def_irq_handler    DMA_21_DriverIRQHandler
    def_irq_handler    DMA_22_DriverIRQHandler
    def_irq_handler    DMA_23_DriverIRQHandler
    def_irq_handler    DMA_24_DriverIRQHandler
    def_irq_handler    DMA_25_DriverIRQHandler
    def_irq_handler    DMA_26_DriverIRQHandler
    def_irq_handler    DMA_27_DriverIRQHandler
    def_irq_handler    DMA_28_DriverIRQHandler
    def_irq_handler    DMA_29_DriverIRQHandler
    def_irq_handler    DMA_30_DriverIRQHandler
    def_irq_handler    DMA_31_DriverIRQHandler
    def_irq_handler    DMA4_ERROR_DriverIRQHandler
    def_irq_handler    DMA4_0_1_DriverIRQHandler
    def_irq_handler    DMA4_2_3_DriverIRQHandler
    def_irq_handler    DMA4_4_5_DriverIRQHandler
    def_irq_handler    DMA4_6_7_DriverIRQHandler
    def_irq_handler    DMA4_8_9_DriverIRQHandler
    def_irq_handler    DMA4_10_11_DriverIRQHandler
    def_irq_handler    DMA4_12_13_DriverIRQHandler
    def_irq_handler    DMA4_14_15_DriverIRQHandler
    def_irq_handler    DMA4_16_17_DriverIRQHandler
    def_irq_handler    DMA4_18_19_DriverIRQHandler
    def_irq_handler    DMA4_20_21_DriverIRQHandler
    def_irq_handler    DMA4_22_23_DriverIRQHandler
    def_irq_handler    DMA4_24_25_DriverIRQHandler
    def_irq_handler    DMA4_26_27_DriverIRQHandler
    def_irq_handler    DMA4_28_29_DriverIRQHandler
    def_irq_handler    DMA4_30_31_DriverIRQHandler
    def_irq_handler    Reserved160_IRQHandler
    def_irq_handler    Reserved161_IRQHandler
    def_irq_handler    Reserved162_IRQHandler
    def_irq_handler    Reserved163_IRQHandler
    def_irq_handler    Reserved164_IRQHandler
    def_irq_handler    Reserved165_IRQHandler
    def_irq_handler    Reserved166_IRQHandler
    def_irq_handler    Reserved167_IRQHandler
    def_irq_handler    LPI2C5_DriverIRQHandler
    def_irq_handler    LPI2C6_DriverIRQHandler
    def_irq_handler    SAI4_DriverIRQHandler
    def_irq_handler    SPDIF_DriverIRQHandler
    def_irq_handler    LPUART9_DriverIRQHandler
    def_irq_handler    LPUART10_DriverIRQHandler
    def_irq_handler    LPUART11_DriverIRQHandler
    def_irq_handler    LPUART12_DriverIRQHandler
    def_irq_handler    Reserved176_IRQHandler
    def_irq_handler    Reserved177_IRQHandler
    def_irq_handler    Reserved178_IRQHandler
    def_irq_handler    Reserved179_IRQHandler
    def_irq_handler    TMR3_IRQHandler
    def_irq_handler    TMR4_IRQHandler
    def_irq_handler    M33_SYSRESET_REQ_IRQHandler
    def_irq_handler    M33_LOCKUP_IRQHandler
    def_irq_handler    M7_SYSRESET_REQ_IRQHandler
    def_irq_handler    M7_LOCKUP_IRQHandler
    def_irq_handler    PWM2_FAULT_IRQHandler
    def_irq_handler    PWM2_0_IRQHandler
    def_irq_handler    PWM2_1_IRQHandler
    def_irq_handler    PWM2_2_IRQHandler
    def_irq_handler    PWM2_3_IRQHandler
    def_irq_handler    PWM3_FAULT_IRQHandler
    def_irq_handler    PWM3_0_IRQHandler
    def_irq_handler    PWM3_1_IRQHandler
    def_irq_handler    PWM3_2_IRQHandler
    def_irq_handler    PWM3_3_IRQHandler
    def_irq_handler    PWM4_FAULT_IRQHandler
    def_irq_handler    PWM4_0_IRQHandler
    def_irq_handler    PWM4_1_IRQHandler
    def_irq_handler    PWM4_2_IRQHandler
    def_irq_handler    PWM4_3_IRQHandler
    def_irq_handler    EQDC1_IRQHandler
    def_irq_handler    EQDC2_IRQHandler
    def_irq_handler    EQDC3_IRQHandler
    def_irq_handler    EQDC4_IRQHandler
    def_irq_handler    ADC2_IRQHandler
    def_irq_handler    DCDC_IRQHandler
    def_irq_handler    CAN3_DriverIRQHandler
    def_irq_handler    CAN3_ERROR_DriverIRQHandler
    def_irq_handler    DAC_IRQHandler
    def_irq_handler    LPSPI5_DriverIRQHandler
    def_irq_handler    LPSPI6_DriverIRQHandler
    def_irq_handler    LPUART7_DriverIRQHandler
    def_irq_handler    LPUART8_DriverIRQHandler
    def_irq_handler    SAI2_DriverIRQHandler
    def_irq_handler    SAI3_DriverIRQHandler
    def_irq_handler    ACMP1_IRQHandler
    def_irq_handler    ACMP2_IRQHandler
    def_irq_handler    ACMP3_IRQHandler
    def_irq_handler    ACMP4_IRQHandler
    def_irq_handler    Reserved220_IRQHandler
    def_irq_handler    Reserved221_IRQHandler
    def_irq_handler    Reserved222_IRQHandler
    def_irq_handler    Reserved223_IRQHandler
    def_irq_handler    Reserved224_IRQHandler
    def_irq_handler    GPT1_IRQHandler
    def_irq_handler    GPT2_IRQHandler
    def_irq_handler    KPP_IRQHandler
    def_irq_handler    USBPHY1_IRQHandler
    def_irq_handler    USBPHY2_IRQHandler
    def_irq_handler    USB_OTG2_IRQHandler
    def_irq_handler    USB_OTG1_IRQHandler
    def_irq_handler    XSPI_SLV_DriverIRQHandler
    def_irq_handler    NETC_IRQHandler
    def_irq_handler    MSGINTR1_IRQHandler
    def_irq_handler    MSGINTR2_IRQHandler
    def_irq_handler    MSGINTR3_IRQHandler
    def_irq_handler    MSGINTR4_IRQHandler
    def_irq_handler    MSGINTR5_IRQHandler
    def_irq_handler    MSGINTR6_IRQHandler
    def_irq_handler    SINC1_0_IRQHandler
    def_irq_handler    SINC1_1_IRQHandler
    def_irq_handler    SINC1_2_IRQHandler
    def_irq_handler    SINC1_3_IRQHandler
    def_irq_handler    SINC2_0_IRQHandler
    def_irq_handler    SINC2_1_IRQHandler
    def_irq_handler    SINC2_2_IRQHandler
    def_irq_handler    SINC2_3_IRQHandler
    def_irq_handler    GPIO4_0_IRQHandler
    def_irq_handler    GPIO4_1_IRQHandler
    def_irq_handler    GPIO5_0_IRQHandler
    def_irq_handler    GPIO5_1_IRQHandler
    def_irq_handler    GPIO6_0_IRQHandler
    def_irq_handler    GPIO6_1_IRQHandler
    def_irq_handler    ECAT_IRQHandler

    .end
